app/controllers/events_controller.rb

  def index
    @start = params[:start]
    @end = params[:end]

    @network = Network.find_by_web_key(params[:web_key])
---
SELECT `networks`.* FROM `networks` WHERE `networks`.`web_key` = '6music' LIMIT 1

  def show
    @event = Event.find_by_realtime_id(params[:realtime_id])
---
SELECT `events`.* FROM `events` WHERE `events`.`realtime_id` = 330638 LIMIT 1