app/controllers/networks_controller.rb

SELECT `networks`.* FROM `networks`
---
  def index
    @networks = Network.all

SELECT `networks`.* FROM `networks` WHERE `networks`.`id` = 1 LIMIT 1
---
  def show
    @network = Network.find(params[:id])