app/controllers/schedules_controller.rb

  def index
    @network = Network.find_by_web_key(params[:web_key])
---
SELECT `networks`.* FROM `networks` WHERE `networks`.`web_key` = '6music' LIMIT 1